const book = {
    bookName: "الإسلام والإيمان"
    ,hasFasls: false,
    themas: [
        {id: 1, name: "أركان الإسلام والإيمان"},
        {id: 2, name: "الإخلاص والنية"},
        {id: 3, name: "الإسلام يهدم ما قبله"},
        {id: 4, name: "الإسلام نسخ الأديان السابقة"},
        {id: 5, name: "من مات على التوحيد دخل الجنة"},
        {id: 6, name: "من مات على الكفر دخل النار"},
        {id: 7, name: "حتى يقولوا \"لا إلاه إلا الله \""},
        {id: 8, name: "الزمن الذي لا يقبل فيه إيمان"},
        {id: 9, name: "الرحمن الرحيم"},
        {id: 10, name: "ادعوني أستجب لكم"},
        {id: 11, name: "إن الله لا ينام"},
        {id: 12, name: "صفة الصبر وغيرها"},
        {id: 13, name: "لا أحد أغير من الله تعالى"},
        {id: 14, name: "مؤمن بالله وكافر بالكواكب"},
        {id: 15, name: "حلاوة الإيمان"},
        {id: 16, name: "شعب الإيمان"},
        {id: 17, name: "حب النبي صلى الله عليه وسلم من الإيمان"},
        {id: 18, name: "الأمر بالعروف والنهي عن المنكر"},
        {id: 19, name: "من أمر بالمعروف ولم يأته"},
        {id: 20, name: "الإسلام والإيمان والإحسان"},
        {id: 21, name: "الوسوسة وحديث النفس"},
        {id: 22, name: "قول الشيطان : من خلق ربك ؟"},
        {id: 23, name: "كتابة الحسنات والسيئات"},
        {id: 24, name: "جزاء الحسنات للمؤمن والكافر"},
        {id: 25, name: "من عمل خيراً قبل إسلامه"},
        {id: 26, name: "الاقتصار على الفروض"},
        {id: 27, name: "الدين يسر"},
        {id: 28, name: "الدين النصيحة"},
        {id: 29, name: "المسلم والمهاجر"},
        {id: 30, name: "قل آمنت بالله ثم استقم"},
        {id: 31, name: "ما يحب لنفسه"},
        {id: 32, name: "المنافقون وصفاتهم"},
        {id: 33, name: "البيعة"},
        {id: 34, name: "الثبات على الدين"},
        {id: 35, name: "(احفظ الله يحفظك)"},
        {id: 36, name: "أجر الدعوة إلى الله"},
        {id: 37, name: "زيادة الإيمان ونقصانه"},
        {id: 38, name: "افتراق هذه الأمة"},
        {id: 38, name: "تجديد أمر الدين وتأييده"},
        {id: 38, name: "نقض عرا الدين"}
    ],
    ahadith_sharefa: [
        {
            themaId: 1,
            numberInMasnad: 6015,
            numberInSite: 1,
            text: `عَنْ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم، قَالَ: " بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لَا إِلَهَ إِلَّا اللهُ، وَأَنَّ مُحَمَّدًا رَسُولُ اللهِ، وَإِقَامِ الصَّلَاةِ، وَإِيتَاءِ الزَّكَاةِ، وَحَجِّ الْبَيْتِ، وَصَوْمِ رَمَضَانَ "`,
            searchText : `عن ابن عمر، عن النبي صلى الله عليه وسلم، قال: " بني الإسلام على خمس: شهادة أن لا إله إلا الله، وأن محمدا رسول الله، وإقام الصلاة، وإيتاء الزكاة، وحج البيت، وصوم رمضان "`,
            info: `حديث متفق عليه <br/>إسناده صحيح`,
        },
        {
            themaId: 1,
            numberInMasnad: 12457,
            numberInSite: 2,
            text: `عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ: كُنَّا قَدْ نُهِينَا أَنْ نَسْأَلَ رَسُولَ اللهِ صلى الله عليه وسلم عَنْ شَيْءٍ ، فَكَانَ يُعْجِبُنَا أَنْ يَجِيءَ الرَّجُلُ مِنْ أَهْلِ الْبَادِيَةِ الْعَاقِلُ، فَيَسْأَلُهُ وَنَحْنُ نَسْمَعُ، فَجَاءَ رَجُلٌ مِنْ أَهْلِ الْبَادِيَةِ، فَقَالَ: يَا مُحَمَّدُ، أَتَانَا رَسُولُكَ فَزَعَمَ لَنَا أَنَّكَ تَزْعُمُ أَنَّ اللهَ أَرْسَلَكَ. قَالَ: " صَدَقَ " قَالَ: فَمَنْ خَلَقَ السَّمَاءَ؟ قَالَ: " اللهُ " قَالَ: فَمَنْ خَلَقَ الْأَرْضَ؟ قَالَ: " اللهُ " قَالَ: فَمَنْ نَصَبَ هَذِهِ الْجِبَالَ، وَجَعَلَ فِيهَا مَا جَعَلَ؟ قَالَ: " اللهُ " قَالَ: فَبِالَّذِي خَلَقَ السَّمَاءَ، وَخَلَقَ الْأَرْضَ، وَنَصَبَ هَذِهِ الْجِبَالَ، آللَّهُ أَرْسَلَكَ؟ قَالَ: " نَعَمْ "<br /> قَالَ: فَزَعَمَ رَسُولُكَ أَنَّ عَلَيْنَا خَمْسَ صَلَوَاتٍ فِي يَوْمِنَا وَلَيْلَتِنَا. قَالَ: " صَدَقَ " قَالَ: فَبِالَّذِي أَرْسَلَكَ، آللَّهُ أَمَرَكَ بِهَذَا؟ قَالَ: " نَعَمْ "<br/>قَالَ: وَزَعَمَ رَسُولُكَ أَنَّ عَلَيْنَا زَكَاةً فِي أَمْوَالِنَا. قَالَ: " صَدَقَ " قَالَ: فَبِالَّذِي أَرْسَلَكَ. آللَّهُ أَمَرَكَ بِهَذَا؟ قَالَ: " نَعَمْ "</br>قَالَ: وَزَعَمَ رَسُولُكَ أَنَّ عَلَيْنَا صَوْمَ شَهْرِ  فِي سَنَتِنَا. قَالَ: " صَدَقَ " . قَالَ: فَبِالَّذِي أَرْسَلَكَ، آللَّهُ أَمَرَكَ بِهَذَا؟ قَالَ: " نَعَمْ "<br/>قَالَ: وَزَعَمَ رَسُولُكَ أَنَّ عَلَيْنَا حَجَّ الْبَيْتِ مَنْ اسْتَطَاعَ إِلَيْهِ سَبِيلًا. قَالَ: " صَدَقَ "<br/>قَالَ: ثُمَّ وَلَّى، فَقَالَ: وَالَّذِي بَعَثَكَ بِالْحَقِّ ، لَا أَزِيدُ عَلَيْهِنَّ شَيْئًا، وَلَا أَنْقُصُ مِنْهُنَّ شَيْئًا. فَقَالَ النَّبِيُّ صلى الله عليه وسلم: " لَئِنْ صَدَقَ، لَيَدْخُلَنَّ الْجَنَّةَ "`,
            searchText : `عن أنس بن مالك قال: كنا قد نهينا أن نسأل رسول الله صلى الله عليه وسلم عن شيء ، فكان يعجبنا أن يجيء الرجل من أهل البادية العاقل، فيسأله ونحن نسمع، فجاء رجل من أهل البادية، فقال: يا محمد، أتانا رسولك فزعم لنا أنك تزعم أن الله أرسلك. قال: " صدق " قال: فمن خلق السماء؟ قال: " الله " قال: فمن خلق الأرض؟ قال: " الله " قال: فمن نصب هذه الجبال، وجعل فيها ما جعل؟ قال: " الله " قال: فبالذي خلق السماء، وخلق الأرض، ونصب هذه الجبال، آلله أرسلك؟ قال: " نعم " قال: وزعم رسولك أن علينا زكاة في أموالنا. قال: " صدق " قال: فبالذي أرسلك. آلله أمرك بهذا؟ قال: " نعم ".
            قال: وزعم رسولك أن علينا صوم شهر  في سنتنا. قال: " صدق ". قال: فبالذي أرسلك، آلله أمرك بهذا؟ قال: " نعم ".
            قال: وزعم رسولك أن علينا حج البيت من استطاع إليه سبيلا. قال: " صدق ".
            قال: ثم ولى، فقال: والذي بعثك بالحق ، لا أزيد عليهن شيئا، ولا أنقص منهن شيئا. فقال النبي صلى الله عليه وسلم: " لئن صدق، ليدخلن الجنة "`,
            info: `رواه مسلم <br> إسناده صحيح على شرط مسلم`,
        },
        {
            themaId: 1,
            numberInMasnad: "22016/22133",
            numberInSite: 3,
            text: `عَنْ مُعَاذِ بْنِ جَبَلٍ، قَالَ: كُنْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي سَفَرٍ، فَأَصْبَحْتُ يَوْمًا قَرِيبًا مِنْهُ وَنَحْنُ نَسِيرُ، فَقُلْتُ: يَا نَبِيَّ اللهِ، أَخْبِرْنِي بِعَمَلٍ يُدْخِلُنِي الْجَنَّةَ، وَيُبَاعِدُنِي مِنَ النَّارِ. قَالَ: " لَقَدْ سَأَلْتَ عَنْ عَظِيمٍ، وَإِنَّهُ لَيَسِيرٌ عَلَى مَنْ يَسَّرَهُ اللهُ عَلَيْهِ، تَعْبُدُ اللهَ وَلَا تُشْرِكُ بِهِ شَيْئًا، وَتُقِيمُ الصَّلَاةَ، وَتُؤْتِي الزَّكَاةَ، وَتَصُومُ رَمَضَانَ، وَتَحُجُّ الْبَيْتَ " ثُمَّ قَالَ: " أَلَا أَدُلُّكَ عَلَى أَبْوَابِ الْخَيْرِ؟: الصَّوْمُ جُنَّةٌ، وَالصَّدَقَةُ تُطْفِئُ الْخَطِيئَةَ، وَصَلَاةُ الرَّجُلِ فِي جَوْفِ اللَّيْلِ " ثُمَّ قَرَأَ: {تَتَجَافَى جُنُوبُهُمْ عَنِ الْمَضَاجِعِ} حَتَّى بَلَغَ {يَعْمَلُونَ} [السجدة: 16 - 17] ثُمَّ قَالَ: " أَلَا أُخْبِرُكَ بِرَأْسِ الْأَمْرِ وَعَمُودِهِ وَذُرْوَةِ سَنَامِهِ؟ " فَقُلْتُ: بَلَى يَا رَسُولَ اللهِ. قَالَ: " رَأْسُ الْأَمْرِ الْإِسْلَامُ ، وَعَمُودُهُ الصَّلَاةُ، وَذِرْوَةُ سَنَامِهِ الْجِهَادُ " ثُمَّ قَالَ: " أَلَا أُخْبِرُكَ بِمِلَاكِ ذَلِكَ كُلِّهِ؟ " فَقُلْتُ لَهُ: بَلَى يَا نَبِيَّ اللهِ. فَأَخَذَ بِلِسَانِهِ، فَقَالَ: " كُفَّ عَلَيْكَ هَذَا " فَقُلْتُ: يَا رَسُولَ اللهِ، وَإِنَّا لَمُؤَاخَذُونَ بِمَا نَتَكَلَّمُ بِهِ؟ فَقَالَ: " ثَكِلَتْكَ أُمُّكَ يَا مُعَاذُ، وَهَلْ يَكُبُّ النَّاسَ فِي النَّارِ عَلَى وُجُوهِهِمْ  - أَوْ قَالَ: عَلَى مَنَاخِرِهِمْ - إِلَّا حَصَائِدُ أَلْسِنَتِهِمْ؟!  <br/>وفي رواية قال: " سَأُنَبِّئُكَ بِأَبْوَابٍ مِنَ الْخَيْرِ: الصَّوْمُ جُنَّةٌ، وَالصَّدَقَةُ تُطْفِئُ الْخَطِيئَةَ كَمَا يُطْفِئُ الْمَاءُ النَّارَ، وَقِيَامُ الْعَبْدِ مِنَ اللَّيْلِ " ثُمَّ قَرَأَ {تَتَجَافَى جُنُوبُهُمْ عَنِ الْمَضَاجِعِ} إِلَى آخِرِ الْآيَةِ [السجدة: 16]"`,
            searchText : `عن معاذ بن جبل، قال: كنت مع النبي صلى الله عليه وسلم في سفر، فأصبحت يوما قريبا منه ونحن نسير، فقلت: يا نبي الله، أخبرني بعمل يدخلني الجنة، ويباعدني من النار. قال: " لقد سألت عن عظيم، وإنه ليسير على من يسره الله عليه، تعبد الله ولا تشرك به شيئا، وتقيم الصلاة، وتؤتي الزكاة، وتصوم رمضان، وتحج البيت " ثم قال: " ألا أدلك على أبواب الخير؟: الصوم جنة، والصدقة تطفئ الخطيئة، وصلاة الرجل في جوف الليل " ثم قرأ: {تتجافى جنوبهم عن المضاجع} حتى بلغ {يعملون} [السجدة: 16 - 17] ثم قال: " ألا أخبرك برأس الأمر وعموده وذروة سنامه؟ " فقلت: بلى يا رسول الله. قال: " رأس الأمر الإسلام ، وعموده الصلاة، وذروة سنامه الجهاد " ثم قال: " ألا أخبرك بملاك ذلك كله؟ " فقلت له: بلى يا نبي الله. فأخذ بلسانه، فقال: " كف عليك هذا " فقلت: يا رسول الله، وإنا لمؤاخذون بما نتكلم به؟ فقال: " ثكلتك أمك يا معاذ، وهل يكب الناس في النار على وجوههم  - أو قال: على مناخرهم - إلا حصائد ألسنتهم؟! "`,
            info: `صحيح بطرقه وشواهده`,
        },
        {
            themaId: 1,
            numberInMasnad: 22122,
            numberInSite: 4,
            text: `عَنْ حَدِيثِ مُعَاذِ بْنِ جَبَلٍ: أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم خَرَجَ بِالنَّاسِ قِبَلَ غَزْوَةِ تَبُوكَ، فَلَمَّا أَنْ أَصْبَحَ صَلَّى بِالنَّاسِ صَلَاةَ الصُّبْحِ، ثُمَّ إِنَّ النَّاسَ رَكِبُوا، فَلَمَّا أَنْ طَلَعَتِ الشَّمْسُ نَعَسَ النَّاسُ عَلَى أَثَرِ الدُّلْجَةِ وَلَزِمَ مُعَاذٌ رَسُولَ اللهِ صلى الله عليه وسلم يَتْلُو أَثَرَهُ، وَالنَّاسُ تَفَرَّقَتْ بِهِمْ رِكَابُهُمْ عَلَى جَوَادِّ الطَّرِيقِ ، تَأْكُلُ وَتَسِيرُ، فَبَيْنَمَا مُعَاذٌ عَلَى أَثَرِ رَسُولِ اللهِ صلى الله عليه وسلم وَنَاقَتُهُ تَأْكُلُ مَرَّةً وَتَسِيرُ أُخْرَى، عَثَرَتْ نَاقَةُ مُعَاذٍ فَكَبَحَهَا بِالزِّمَامِ، فَهَبَّتْ حَتَّى نَفَرَتْ مِنْهَا نَاقَةُ رَسُولِ اللهِ صلى الله عليه وسلم، ثُمَّ إِنَّ رَسُولَ اللهِ صلى الله عليه وسلم كَشْفَ عَنْهُ قِنَاعَهُ، فَالْتَفَتَ فَإِذَا لَيْسَ مِنَ الْجَيْشِ رَجُلٌ أَدْنَى إِلَيْهِ مِنْ مُعَاذٍ، فَنَادَاهُ رَسُولُ اللهِ صلى الله عليه وسلم فَقَالَ: " يَا مُعَاذُ " قَالَ: لَبَّيْكَ يَا نَبِيَّ اللهِ. قَالَ: " ادْنُ دُونَكَ " فَدَنَا مِنْهُ حَتَّى لَصِقَتْ رَاحِلَتَاهُمَا إِحْدَاهُمَا بِالْأُخْرَى، فَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم: " مَا كُنْتُ أَحْسِبُ النَّاسَ مِنَّا كَمَكَانِهِمْ مِنَ الْبُعْدِ " فَقَالَ مُعَاذٌ: يَا نَبِيَّ اللهِ، نَعَسَ النَّاسُ، فَتَفَرَّقَتْ بِهِمْ رِكَابُهُمْ تَرْتَعُ وَتَسِيرُ. فَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم: " وَأَنَا كُنْتُ نَاعِسًا "<br/>فَلَمَّا رَأَى مُعَاذٌ بُشْرَى رَسُولِ اللهِ صلى الله عليه وسلم إِلَيْهِ وَخَلْوَتَهُ لَهُ، قَالَ: يَا رَسُولَ اللهِ، ائْذَنْ لِي أَسْأَلْكَ عَنْ كَلِمَةٍ قَدْ أَمْرَضَتْنِي وَأَسْقَمَتْنِي وَأَحْزَنَتْنِي. فَقَالَ نَبِيُّ اللهِ صلى الله عليه وسلم: " سَلْنِي عَمَّ شِئْتَ " قَالَ: يَا نَبِيَّ اللهِ، حَدِّثْنِي بِعَمَلٍ يُدْخِلُنِي الْجَنَّةَ لَا أَسْأَلُكَ عَنْ شَيْءٍ غَيْرِه. قَالَ نَبِيُّ اللهِ صلى الله عليه وسلم: " بَخٍ بَخٍ بَخٍ، لَقَدْ سَأَلْتَ بِعَظِيمٍ، لَقَدْ سَأَلْتَ بِعَظِيمٍ - ثَلَاثًا - وَإِنَّهُ لَيَسِيرٌ عَلَى مَنْ أَرَادَ اللهُ بِهِ الْخَيْرَ، وَإِنَّهُ لَيَسِيرٌ عَلَى مَنْ أَرَادَ اللهُ بِهِ الْخَيْرَ، وَإِنَّهُ لَيَسِيرٌ عَلَى مَنْ أَرَادَ اللهُ بِهِ الْخَيْرَ " فَلَمْ يُحَدِّثْهُ بِشَيْءٍ إِلَّا قَالَهُ لَهُ ثَلَاثَ مَرَّاتٍ، يَعْنِي: أَعَادَهُ عَلَيْهِ ثَلَاثَ مَرَّاتٍ حِرْصًا لِكَيْمَا يُتْقِنَهُ عَنْهُ، فَقَالَ نَبِيُّ اللهِ صلى الله عليه وسلم: " تُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ، وَتُقِيمُ الصَّلَاةَ، وَتَعْبُدُ اللهَ وَحْدَهُ لَا تُشْرِكُ بِهِ شَيْئًا حَتَّى تَمُوتَ وَأَنْتَ عَلَى ذَلِكَ " فَقَالَ: يَا نَبِيَّ اللهِ، أَعِدْ لِي، فَأَعَادَهَا لَهُ ثَلَاثَ مَرَّاتٍ<br/> ثُمَّ قَالَ نَبِيُّ اللهِ صلى الله عليه وسلم: " إِنْ شِئْتَ حَدَّثْتُكَ يَا مُعَاذُ بِرَأْسِ هَذَا الْأَمْرِ وَقَوَامِ هَذَا الْأَمْرِ، وَذُرْوَةِ السَّنَامِ " فَقَالَ مُعَاذٌ: بَلَى، بِأَبِي وَأُمِّي أَنْتَ يَا نَبِيَّ اللهِ، فَحَدِّثْنِي. فَقَالَ نَبِيُّ اللهِ صلى الله عليه وسلم: " إِنَّ رَأْسَ هَذَا الْأَمْرِ أَنْ تَشْهَدَ أَنْ لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ، وَإِنَّ قَوَامَ هَذَا الْأَمْرِ إِقَامُ الصَّلَاةِ وَإِيتَاءُ الزَّكَاةِ، وَإِنَّ ذُرْوَةَ السَّنَامِ مِنْهُ الْجِهَادُ فِي سَبِيلِ اللهِ، إِنَّمَا أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يُقِيمُوا الصَّلَاةَ وَيُؤْتُوا الزَّكَاةَ، وَيَشْهَدُوا أَنْ لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ، فَإِذَا فَعَلُوا ذَلِكَ فَقَدِ اعْتَصَمُوا وَعَصَمُوا دِمَاءَهُمْ وَأَمْوَالَهُمْ، إِلَّا بِحَقِّهَا، وَحِسَابُهُمْ عَلَى اللهِ "<br/>وَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم: " وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ، مَا شَحَبَ وَجْهٌ، وَلَا اغْبَرَّتْ قَدَمٌ فِي عَمَلٍ تُبْتَغَى فِيهِ دَرَجَاتُ الْجَنَّةِ بَعْدَ الصَّلَاةِ الْمَفْرُوضَةِ، كَجِهَادٍ فِي سَبِيلِ اللهِ، وَلَا ثَقُلَ مِيزَانُ عَبْدٍ، كَدَابَّةٍ تَنْفُقُ لَهُ فِي سَبِيلِ اللهِ، أَوْ يَحْمِلُ عَلَيْهَا فِي سَبِيلِ اللهِ "`,
            searchText : `عن حديث معاذ بن جبل: أن رسول الله صلى الله عليه وسلم خرج بالناس قبل غزوة تبوك، فلما أن أصبح صلى بالناس صلاة الصبح، ثم إن الناس ركبوا، فلما أن طلعت الشمس نعس الناس على أثر الدلجة ولزم معاذ رسول الله صلى الله عليه وسلم يتلو أثره، والناس تفرقت بهم ركابهم على جواد الطريق (1)، تأكل وتسير، فبينما معاذ على أثر رسول الله صلى الله عليه وسلم وناقته تأكل مرة وتسير أخرى، عثرت ناقة معاذ فكبحها بالزمام، فهبت حتى نفرت منها ناقة رسول الله صلى الله عليه وسلم، ثم إن رسول الله صلى الله عليه وسلم كشف عنه قناعه، فالتفت فإذا ليس من الجيش رجل أدنى إليه من معاذ، فناداه رسول الله صلى الله عليه وسلم فقال: " يا معاذ " قال: لبيك يا نبي الله. قال: " ادن دونك " فدنا منه حتى لصقت راحلتاهما إحداهما بالأخرى، فقال رسول الله صلى الله عليه وسلم: " ما كنت أحسب الناس منا كمكانهم من البعد " فقال معاذ: يا نبي الله، نعس الناس، فتفرقت بهم ركابهم ترتع وتسير. فقال رسول الله صلى الله عليه وسلم: " وأنا كنت ناعسا ".
            فلما رأى معاذ بشرى رسول الله صلى الله عليه وسلم إليه وخلوته له، قال: يا رسول الله، ائذن لي أسألك عن كلمة قد أمرضتني وأسقمتني وأحزنتني. فقال نبي الله صلى الله عليه وسلم: " سلني عم شئت " قال: يا نبي الله، حدثني بعمل يدخلني الجنة لا أسألك عن شيء غيره. قال نبي الله صلى الله عليه وسلم: " بخ بخ بخ، لقد سألت بعظيم، لقد سألت بعظيم - ثلاثا - وإنه ليسير على من أراد الله به الخير، وإنه ليسير على من أراد الله به الخير، وإنه ليسير على من أراد الله به الخير " فلم يحدثه بشيء إلا قاله له ثلاث مرات، يعني: أعاده عليه ثلاث مرات حرصا لكيما يتقنه عنه، فقال نبي الله صلى الله عليه وسلم: " تؤمن بالله واليوم الآخر، وتقيم الصلاة، وتعبد الله وحده لا تشرك به شيئا حتى تموت وأنت على ذلك " فقال: يا نبي الله، أعد لي، فأعادها له ثلاث مرات.
            ثم قال نبي الله صلى الله عليه وسلم: " إن شئت حدثتك يا معاذ برأس هذا الأمر وقوام هذا الأمر، وذروة السنام " فقال معاذ: بلى، بأبي وأمي أنت يا نبي الله، فحدثني. فقال نبي الله صلى الله عليه وسلم: " إن رأس هذا الأمر أن تشهد أن لا إله إلا الله وحده لا شريك له، وأن محمدا عبده ورسوله، وإن قوام هذا الأمر إقام الصلاة وإيتاء الزكاة، وإن ذروة السنام منه الجهاد في سبيل الله، إنما أمرت أن أقاتل الناس حتى يقيموا الصلاة ويؤتوا الزكاة، ويشهدوا أن لا إله إلا الله وحده لا شريك له وأن محمدا عبده ورسوله، فإذا فعلوا ذلك فقد اعتصموا وعصموا دماءهم وأموالهم، إلا بحقها، وحسابهم على الله ".
            وقال رسول الله صلى الله عليه وسلم: " والذي نفس محمد بيده، ما شحب وجه، ولا اغبرت قدم في عمل تبتغى فيه درجات الجنة بعد الصلاة المفروضة، كجهاد في سبيل الله، ولا ثقل ميزان عبد، كدابة تنفق له في سبيل الله، أو يحمل عليها في سبيل الله "`,
            info: ` الحديث من سؤال معاذ إلى آخره صحيح بطرقه وشواهده دون قوله: "ما شحب وجه … إلخ" فإنه حسن لغيره، وهذا إسناد ضعيف لضعف شهر بن حوشب`,
        },
        {
            themaId: 1,
            numberInMasnad: 19220,
            numberInSite: 5,
            text: `عَنْ جَرِيرٍ، قَالَ: قَالَ رَسُولُ اللهِ صلى الله عليه وسلم: " بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لَا إِلَهَ إِلَّا اللهُ، وَإِقَامِ الصَّلَاةِ، وَإِيتَاءِ الزَّكَاةِ، وَحَجُِّ الْبَيْتِ، وَصَوْمِ رَمَضَانَ "`,
            searchText : `عن جرير، قال: قال رسول الله صلى الله عليه وسلم: " بني الإسلام على خمس: شهادة أن لا إله إلا الله، وإقام الصلاة، وإيتاء الزكاة، وحج البيت، وصوم رمضان "`,
            info: `صحيح لغيره`,
        },
        {
            themaId: 1,
            numberInMasnad: 22768,
            numberInSite: 6,
            text: `عَنْ عُبَادَةَ بْنِ الصَّامِتِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ: " مَنْ عَبَدَ اللهَ لَا يُشْرِكُ بِهِ شَيْئًا فَأَقَامَ الصَّلَاةَ، وَآتَى الزَّكَاةَ، وَسَمِعَ وَأَطَاعَ، فَإِنَّ اللهَ يُدْخِلُهُ مِنْ أَيِّ أَبْوَابِ الْجَنَّةِ شَاءَ، وَلَهَا ثَمَانِيَةُ أَبْوَابٍ، وَمَنْ عَبَدَ اللهَ لَا يُشْرِكُ بِهِ شَيْئًا، وَأَقَامَ الصَّلَاةَ، وَآتَى الزَّكَاةَ، وَسَمِعَ وَعَصَى، فَإِنَّ اللهَ مِنْ أَمْرِهِ بِالْخِيَارِ، إِنْ شَاءَ رَحِمَهُ، وَإِنْ شَاءَ عَذَّبَهُ "`,
            searchText : `عن عبادة بن الصامت، أن النبي صلى الله عليه وسلم قال: " من عبد الله لا يشرك به شيئا فأقام الصلاة، وآتى الزكاة، وسمع وأطاع، فإن الله يدخله من أي أبواب الجنة شاء، ولها ثمانية أبواب، ومن عبد الله لا يشرك به شيئا، وأقام الصلاة، وآتى الزكاة، وسمع وعصى، فإن الله من أمره بالخيار، إن شاء رحمه، وإن شاء عذبه "`,
            info: `إسناده حسن`,
        },
        {
            themaId: 1,
            numberInMasnad: 20011,
            numberInSite: 7,
            text: `عَنْ حَكِيمِ بْنِ مُعَاوِيَةَ الْبَهْزِيِّ، عَنْ أَبِيهِ، أَنَّهُ قَالَ لِلنَّبِيِّ صلى الله عليه وسلم: إِنِّي حَلَفْتُ هَكَذَا - وَنَشَرَ أَصَابِعَ يَدَيْهِ - حَتَّى تُخْبِرَنِي مَا الَّذِي بَعَثَكَ اللهُ بِهِ. قَالَ: " بَعَثَنِي اللهُ بِالْإِسْلَامِ " قَالَ: وَمَا الْإِسْلَامُ؟ قَالَ: " شَهَادَةُ أَنْ لَا إِلَهَ إِلَّا اللهُ، وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ، وَتُقِيمُ الصَّلَاةَ، وَتُؤْتِي الزَّكَاةَ، أَخَوَانِ نَصِيرَانِ، لَا يَقْبَلُ اللهُ مِنْ أَحَدٍ تَوْبَةً أَشْرَكَ بَعْدَ إِسْلَامِهِ " <br/>قَالَ: قُلْتُ: يَا رَسُولَ اللهِ، مَا حَقُّ زَوْجِ أَحَدِنَا عَلَيْهِ؟ قَالَ: " تُطْعِمُهَا إِذَا أَكَلْتَ، وَتَكْسُوهَا إِذَا اكْتَسَيْتَ، وَلَا تَضْرِبِ الْوَجْهَ، وَلَا تُقَبِّحْ، وَلَا تَهْجُرْ إِلَّا فِي الْبَيْتِ "<br/>ثُمَّ قَالَ: " هَاهُنَا تُحْشَرُونَ، هَاهُنَا تُحْشَرُونَ، هَاهُنَا تُحْشَرُونَ - ثَلَاثًا - رُكْبَانًا وَمُشَاةً وَعَلَى وُجُوهِكُمْ ، تُوفُونَ يَوْمَ الْقِيَامَةِ سَبْعِينَ أُمَّةً، أَنْتُمْ آخِرُ الْأُمَمِ وَأَكْرَمُهَا عَلَى اللهِ، تَأْتُونَ يَوْمَ الْقِيَامَةِ وَعَلَى أَفْوَاهِكُمُ الْفِدَامُ، أَوَّلُ مَا يُعْرِبُ عَنْ أَحَدِكُمْ فَخِذُهُ ". قَالَ ابْنُ أَبِي بُكَيْرٍ: فَأَشَارَ بِيَدِهِ إِلَى الشَّامِ، فَقَالَ: " إِلَى هَاهُنَا تُحْشَرُونَ "`,
            searchText : `عن حكيم بن معاوية البهزي، عن أبيه، أنه قال للنبي صلى الله عليه وسلم: إني حلفت هكذا - ونشر أصابع يديه - حتى تخبرني ما الذي بعثك الله به. قال: " بعثني الله بالإسلام " قال: وما الإسلام؟ قال: " شهادة أن لا إله إلا الله، وأن محمدا عبده ورسوله، وتقيم الصلاة، وتؤتي الزكاة، أخوان نصيران، لا يقبل الله من أحد توبة أشرك بعد إسلامه ".
            قال: قلت: يا رسول الله، ما حق زوج أحدنا عليه؟ قال: " تطعمها إذا أكلت، وتكسوها إذا اكتسيت، ولا تضرب الوجه، ولا تقبح، ولا تهجر إلا في البيت " ثم قال: " هاهنا تحشرون، هاهنا تحشرون، هاهنا تحشرون - ثلاثا - ركبانا ومشاة وعلى وجوهكم ، توفون يوم القيامة سبعين  أمة، أنتم آخر الأمم وأكرمها على الله، تأتون يوم القيامة وعلى أفواهكم الفدام، أول ما يعرب عن أحدكم فخذه ". قال ابن أبي بكير: فأشار بيده إلى الشام، فقال: " إلى هاهنا تحشرون "`,
            info: `إسناده حسن`,
        },
        {
            themaId: 1,
            numberInMasnad: 20043,
            numberInSite: 8,
            text: `أَخْبَرَنَا بَهْزُ بْنُ حَكِيمٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ قَالَ: أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم حِينَ أَتَيْتُهُ فَقُلْتُ: وَاللهِ مَا أَتَيْتُكَ حَتَّى حَلَفْتُ أَكْثَرَ مِنْ عَدَدِ أُولَاءِ أَنْ لَا آتِيَكَ، وَلَا آتِيَ دِينَكَ - وَجَمَعَ بَهْزٌ بَيْنَ كَفَّيْهِ - وَقَدْ جِئْتُ امْرَأً لَا أَعْقِلُ شَيْئًا، إِلَّا مَا عَلَّمَنِي اللهُ وَرَسُولُهُ، وَإِنِّي أَسْأَلُكَ بِوَجْهِ اللهِ، بِمَ بَعَثَكَ اللهُ إِلَيْنَا؟ قَالَ: " بِالْإِسْلَامِ " قُلْتُ: وَمَا آيَاتُ الْإِسْلَامِ؟ قَالَ: " أَنْ تَقُولَ: أَسْلَمْتُ وَجْهِيَ لِلَّهِ، وَتَخَلَّيْتُ، وَتُقِيمَ الصَّلَاةَ، وَتُؤْتِيَ الزَّكَاةَ، كُلُّ مُسْلِمٍ عَلَى مُسْلِمٍ مُحَرَّمٌ، أَخَوَانِ نَصِيرَانِ، لَا يَقْبَلُ اللهُ مِنْ مُشْرِكٍ أَشْرَكَ بَعْدَمَا أَسْلَمَ عَمَلًا، وَتُفَارِقَ الْمُشْرِكِينَ إِلَى الْمُسْلِمِينَ، مَا لِي أُمْسِكُ بِحُجَزِكُمْ عَنِ النَّارِ. <br/>
            أَلَا إِنَّ رَبِّي دَاعِيَّ، وَإِنَّهُ سَائِلِي: هَلْ بَلَّغْتُ عِبَادَهُ؟ وَإِنِّي قَائِلٌ: رَبِّ إِنِّي قَدْ بَلَّغْتُهُمْ. فَلْيُبَلِّغِ الشَّاهِدُ مِنْكُمُ الْغَائِبَ، ثُمَّ إِنَّكُمْ مَدْعُوُّونَ مُفَدَّمَةً أَفْوَاهُكُمْ بِالْفِدَامِ.
            ثُمَّ إِنَّ أَوَّلَ مَا يُبِينُ عَنْ أَحَدِكُمْ لَفَخِذُهُ وَكَفُّهُ " قُلْتُ يَا نَبِيَّ اللهِ، هَذَا دِينُنَا؟ قَالَ: " هَذَا دِينُكُمْ، وَأَيْنَمَا تُحْسِنْ يَكْفِكَ "`,
            searchText : `أخبرنا بهز بن حكيم، عن أبيه، عن جده قال: أتيت النبي صلى الله عليه وسلم حين أتيته فقلت: والله ما أتيتك حتى حلفت أكثر من عدد أولاء أن لا آتيك، ولا آتي دينك - وجمع بهز بين كفيه - وقد جئت امرأ لا أعقل شيئا، إلا ما علمني الله ورسوله، وإني أسألك بوجه الله، بم بعثك الله إلينا؟ قال: " بالإسلام " قلت: وما آيات الإسلام؟ قال: " أن تقول: أسلمت وجهي لله، وتخليت، وتقيم الصلاة، وتؤتي الزكاة، كل مسلم على مسلم محرم، أخوان نصيران، لا يقبل الله من مشرك أشرك بعدما أسلم عملا، وتفارق المشركين إلى المسلمين، ما لي أمسك بحجزكم عن النار.
            ألا إن ربي داعي، وإنه سائلي: هل بلغت عباده؟ وإني قائل: رب إني قد بلغتهم. فليبلغ الشاهد منكم الغائب، ثم إنكم مدعوون مفدمة أفواهكم بالفدام.
            ثم إن أول ما يبين عن أحدكم لفخذه وكفه " قلت يا نبي الله، هذا ديننا؟ قال: " هذا دينكم، وأينما تحسن يكفك "`,
            info: `إسناده حسن`,
        },
        {
            themaId: 1,
            numberInMasnad: 23127,
            numberInSite: 9,
            text: `عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، عَنْ رَجُلٍ مِنْ بَنِي عَامِرٍ: أَنَّهُ اسْتَأْذَنَ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ: أَأَلِجُ ؟ فَقَالَ النَّبِيُّ صلى الله عليه وسلم لِخَادِمِهِ: " اخْرُجِي إِلَيْهِ، فَإِنَّهُ لَا يُحْسِنُ الِاسْتِئْذَانَ، فَقُولِي لَهُ، فَلْيَقُلِ: السَّلَامُ عَلَيْكُمْ، آدْخُلُ؟ " قَالَ فَسَمِعْتُهُ يَقُولُ ذَلِكَ، فَقُلْتُ: السَّلَامُ عَلَيْكُمْ، آدْخُلُ؟ قَالَ: فَأَذِنَ، أَوْ قَالَ: فَدَخَلْتُ، فَقُلْتُ: بِمَ أَتَيْتَنَا بِهِ؟ قَالَ: " لَمْ آتِكُمْ إِلَّا بِخَيْرٍ، أَتَيْتُكُمْ أَنْ تَعْبُدُوا اللهَ وَحْدَهُ لَا شَرِيكَ لَهُ - قَالَ شُعْبَةُ: وَأَحْسِبُهُ قَالَ: وَحْدَهُ لَا شَرِيكَ لَهُ، وَأَنْ تَدَعُوا اللَّاتَ وَالْعُزَّى - وَأَنْ تُصَلُّوا بِاللَّيْلِ وَالنَّهَارِ خَمْسَ صَلَوَاتٍ، وَأَنْ تَصُومُوا مِنَ السَّنَةِ شَهْرًا، وَأَنْ تَحُجُّوا الْبَيْتَ، وَأَنْ تَأْخُذُوا مِنْ أَمْوَالٍ أَغْنِيَائِكُمْ فَتَرُدُّوهَا عَلَى فُقَرَائِكُمْ " قَالَ: فَقَالَ: هَلْ بَقِيَ مِنَ الْعِلْمِ شَيْءٌ لَا تَعْلَمُهُ؟ قَالَ: " قَدْ عَلِمَ اللهُ خَيْرًا، وَإِنَّ مِنَ الْعِلْمِ مَا لَا يَعْلَمُهُ إِلَّا اللهُ، الْخَمْسَ: {إِنَّ اللهَ عِنْدَهُ عِلْمُ السَّاعَةِ وَيُنَزِّلُ الْغَيْثَ وَيَعْلَمُ مَا فِي الْأَرْحَامِ وَمَا تَدْرِي نَفْسٌ مَاذَا تَكْسِبُ غَدًا وَمَا تَدْرِي نَفْسٌ بِأَيِّ أَرْضٍ تَمُوتُ إِنَّ اللهَ عَلِيمٌ خَبِيرٌ} [لقمان: 34] "`,
            searchText : `عن ربعي بن حراش، عن رجل من بني عامر: أنه استأذن على النبي صلى الله عليه وسلم فقال: أألج ؟ فقال النبي صلى الله عليه وسلم لخادمه: " اخرجي إليه، فإنه لا يحسن الاستئذان، فقولي له، فليقل: السلام عليكم، آدخل؟ " قال فسمعته يقول ذلك، فقلت: السلام عليكم، آدخل؟ قال: فأذن، أو قال: فدخلت، فقلت: بم أتيتنا به؟ قال: " لم آتكم إلا بخير، أتيتكم أن تعبدوا الله وحده لا شريك له - قال شعبة: وأحسبه قال: وحده لا شريك له، وأن تدعوا اللات والعزى - وأن تصلوا بالليل والنهار خمس صلوات، وأن تصوموا من السنة شهرا، وأن تحجوا البيت، وأن تأخذوا من أموال أغنيائكم فتردوها على فقرائكم " قال: فقال: هل بقي من العلم شيء لا تعلمه؟ قال: " قد علم الله خيرا، وإن من العلم ما لا يعلمه إلا الله، الخمس : {إن الله عنده علم الساعة وينزل الغيث ويعلم ما في الأرحام وما تدري نفس ماذا تكسب غدا وما تدري نفس بأي أرض تموت إن الله عليم خبير} [لقمان: 34] "`,
            info: `صحيح لغيره`,
        },
        {
            themaId: 1,
            numberInMasnad: 23502,
            numberInSite: 10,
            text: `حَدَّثَنَا أَبُو رُهْمٍ السَّمَعِيُّ، أَنَّ أَبَا أَيُّوبَ حَدَّثَهُ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ: " مَنْ جَاءَ يَعْبُدُ اللهَ لَا يُشْرِكُ بِهِ شَيْئًا، وَيُقِيمُ الصَّلَاةَ، وَيُؤْتِي الزَّكَاةَ، وَيَصُومُ رَمَضَانَ، وَيَجْتَنِبُ الْكَبَائِرَ، فَإِنَّ لَهُ الْجَنَّةَ ".<br/>
            وَسَأَلُوهُ: مَا الْكَبَائِرُ، قَالَ: " الْإِشْرَاكُ بِاللهِ، وَقَتْلُ النَّفْسِ الْمُسْلِمَةِ، وَفِرَارٌ يَوِمَ الزَّحْفِ "`,
            searchText : `حدثنا أبو رهم السمعي، أن أبا أيوب حدثه، أن رسول الله صلى الله عليه وسلم قال: " من جاء يعبد الله لا يشرك به شيئا، ويقيم الصلاة، ويؤتي الزكاة، ويصوم رمضان، ويجتنب الكبائر، فإن له الجنة ".
            وسألوه: ما الكبائر، قال: " الإشراك بالله، وقتل النفس المسلمة، وفرار يوم الزحف "`,
            info: `حديث حسن بمجموع طرقه`,
        },
        {
            themaId: 1,
            numberInMasnad: 25121,
            numberInSite: 11,
            text: ` عن شَيْبَةُ الْخُضْرِيُّ ، قَالَ: كُنَّا عِنْدَ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ، فَحَدَّثَنَا عُرْوَةُ بْنُ الزُّبَيْرِ، عَنْ عَائِشَةَ أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ: ثَلَاثٌ أَحْلِفُ عَلَيْهِنَّ، لَا يَجْعَلُ اللهُ عز وجل مَنْ لَهُ سَهْمٌ فِي الْإِسْلَامِ كَمَنْ لَا سَهْمَ لَهُ، وَأَسْهُمُ الْإِسْلَامِ ثَلَاثَةٌ : الصَّلَاةُ، وَالصَّوْمُ، وَالزَّكَاةُ، وَلَا يَتَوَلَّى الله عز وجل عَبْدًا فِي الدُّنْيَا فَيُوَلِّيهِ غَيْرَهُ يَوْمَ الْقِيَامَةِ، وَلَا يُحِبُّ رَجُلٌ قَوْمًا إِلَّا جَعَلَهُ اللهُ عز وجل مَعَهُمْ ، وَالرَّابِعَةُ لَوْ حَلَفْتُ عَلَيْهَا رَجَوْتُ أَنْ لَا آثَمَ: لَا يَسْتُرُ اللهُ عز وجل عَبْدًا فِي الدُّنْيَا إِلَّا سَتَرَهُ يَوْمَ الْقِيَامَةِ ".<br/>
            فَقَالَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ: إِذَا سَمِعْتُمْ مِثْلَ هَذَا الْحَدِيثِ مِنْ مِثْلِ عُرْوَةَ يَرْوِيهِ عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم فَاحْفَظُوهُ`,
            searchText : `شيبة الخضري ، قال: كنا عند عمر بن عبد العزيز، فحدثنا عروة بن الزبير، عن عائشة أن رسول الله صلى الله عليه وسلم قال: ثلاث أحلف عليهن، لا يجعل الله عز وجل من له سهم في الإسلام كمن لا سهم له، وأسهم الإسلام ثلاثة : الصلاة، والصوم، والزكاة، ولا يتولى الله عز وجل عبدا في الدنيا فيوليه غيره يوم القيامة، ولا يحب رجل قوما إلا جعله الله عز وجل معهم ، والرابعة لو حلفت عليها رجوت أن لا آثم: لا يستر الله عز وجل عبدا في الدنيا إلا ستره يوم القيامة ".
            فقال عمر بن عبد العزيز: إذا سمعتم مثل هذا الحديث من مثل عروة شيبة الخضري ، قال: كنا عند عمر بن عبد العزيز، فحدثنا عروة بن الزبير، عن عائشة أن رسول الله صلى الله عليه وسلم قال: ثلاث أحلف عليهن، لا يجعل الله عز وجل من له سهم في الإسلام كمن لا سهم له، وأسهم الإسلام ثلاثة : الصلاة، والصوم، والزكاة، ولا يتولى الله عز وجل عبدا في الدنيا فيوليه غيره يوم القيامة، ولا يحب رجل قوما إلا جعله الله عز وجل معهم ، والرابعة لو حلفت عليها رجوت أن لا آثم: لا يستر الله عز وجل عبدا في الدنيا إلا ستره يوم القيامة ".
            فقال عمر بن عبد العزيز: إذا سمعتم مثل هذا الحديث من مثل عروة`,
            info: `حديث حسن لغيره`,
        },
        {
            themaId: 2,
            numberInMasnad: 300,
            numberInSite: 12,
            text: `عن عُمَرَ بْنَ الْخَطَّابِ وَهُوَ يَخْطُبُ النَّاسَ، وَهُوَ يَقُولُ: سَمِعْتُ رَسُولَ اللهِ صلى الله عليه وسلم، يَقُولُ: " ‌إِنَّمَا ‌الْعَمَلُ ‌بِالنِّيَّةِ، وَإِنَّمَا لِامْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللهِ وَإِلَى رَسُولِهِ، فَهِجْرَتُهُ إِلَى اللهِ وَإِلَى رَسُولِهِ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا، أَوِ امْرَأَةٍ يَتَزَوَّجُهَا، فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ "`,
            searchText : `عمر بن الخطاب وهو يخطب الناس، وهو يقول: سمعت رسول الله صلى الله عليه وسلم، يقول: " ‌إنما ‌العمل ‌بالنية، وإنما لامرئ ما نوى، فمن كانت هجرته إلى الله وإلى رسوله، فهجرته إلى الله وإلى رسوله، ومن كانت هجرته لدنيا يصيبها، أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه "`,
            info: `إسناده صحيح`,
        },
        {
            themaId: 2,
            numberInMasnad: 8277,
            numberInSite: 13,
            text: `عَنْ أَبِي هُرَيْرَةَ أنه قال: سَمِعْتُ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ: " إِنَّ أَوَّلَ النَّاسِ يُقْضَى فِيهِ يَوْمَ الْقِيَامَةِ ثَلَاثَةٌ: رَجُلٌ اسْتُشْهِدَ، فَأُتِيَ بِهِ فَعَرَّفَهُ نِعَمَهُ، فَعَرَفَهَا، فَقَالَ: فَمَا عَمِلْتَ فِيهَا؟ قَالَ: قَاتَلْتُ فِيكَ حَتَّى قُتِلْتُ. قَالَ: كَذَبْتَ، وَلَكِنَّكَ قَاتَلْتَ لِيُقَالَ: هُوَ جَرِيءٌ، فَقَدْ قِيلَ. ثُمَّ أَمَرَ بِهِ فَسُحِبَ  عَلَى وَجْهِهِ حَتَّى أُلْقِيَ فِي النَّارِ.<br/>
            وَرَجُلٌ تَعَلَّمَ الْعِلْمَ وَعَلَّمَهُ وَقَرَأَ الْقُرْآنَ، فَأُتِيَ بِهِ فَعَرَّفَهُ  نِعَمَهُ، فَعَرَفَهَا، فَقَالَ: مَا عَمِلْتَ فِيهَا؟ قَالَ: تَعَلَّمْتُ فِيكَ الْعِلْمَ وَعَلَّمْتُهُ، وَقَرَأْتُ فِيكَ الْقُرْآنَ. فَقَالَ: كَذَبْتَ، وَلَكِنَّكَ تَعَلَّمْتَ لِيُقَالَ هُوَ عَالِمٌ، فَقَدْ قِيلَ، وَقَرَأْتَ الْقُرْآنَ لِيُقَالَ: هُوَ قَارِئٌ، فَقَدْ قِيلَ. ثُمَّ أَمَرَ بِهِ، فَسُحِبَ عَلَى وَجْهِهِ حَتَّى أُلْقِيَ فِي النَّارِ.<br/>
            وَرَجُلٌ وَسَّعَ اللهُ عَلَيْهِ وَأَعْطَاهُ مِنْ أَصْنَافِ الْمَالِ كُلِّهِ، فَأُتِيَ بِهِ فَعَرَّفَهُ نِعَمَهُ فَعَرَفَهَا، فَقَالَ: مَا عَمِلْتَ فِيهَا؟ قَالَ: مَا تَرَكْتُ مِنْ سَبِيلٍ تُحِبُّ أَنْ يُنْفَقَ فِيهَا إِلَّا أَنْفَقْتُ فِيهَا لَكَ. قَالَ: كَذَبْتَ، وَلَكِنَّكَ فَعَلْتَ  لِيُقَالَ: هُوَ جَوَّادٌ، فَقَدْ قِيلَ. ثُمَّ أَمَرَ بِهِ فَسُحِبَ عَلَى وَجْهِهِ حَتَّى أُلْقِيَ فِي النَّارِ "`,
            searchText : `قال: سمعت رسول الله صلى الله عليه وسلم يقول: " إن أول الناس يقضى فيه يوم القيامة ثلاثة: رجل استشهد، فأتي به فعرفه نعمه، فعرفها، فقال: فما عملت فيها؟ قال: قاتلت فيك حتى قتلت. قال: كذبت، ولكنك قاتلت ليقال: هو جريء، فقد قيل. ثم أمر به فسحب  على وجهه حتى ألقي في النار.
            ورجل تعلم العلم وعلمه وقرأ القرآن، فأتي به فعرفه  نعمه، فعرفها، فقال: ما عملت فيها؟ قال: تعلمت فيك العلم وعلمته، وقرأت فيك القرآن. فقال: كذبت، ولكنك تعلمت ليقال هو عالم، فقد قيل، وقرأت القرآن ليقال: هو قارئ، فقد قيل. ثم أمر به، فسحب على وجهه حتى ألقي في النار.
            ورجل وسع الله عليه وأعطاه من أصناف المال كله، فأتي به فعرفه نعمه فعرفها، فقال: ما عملت فيها؟ قال: ما تركت من سبيل تحب أن ينفق فيها إلا أنفقت فيها لك. قال: كذبت، ولكنك فعلت ليقال: هو جواد، فقد قيل. ثم أمر به فسحب على وجهه حتى ألقي في النار "`,
            info: `إسناده صحيح`,
        },
        {
            themaId: 2,
            numberInMasnad: 18031,
            numberInSite: 14,
            text: `عَنْ أَبِي كَبْشَةَ الْأَنْمَارِيِّ قَالَ: سَمِعْتُ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ: " ثَلَاثٌ أُقْسِمُ عَلَيْهِنَّ، وَأُحَدِّثُكُمْ حَدِيثًا فَاحْفَظُوهُ " قَالَ: " فَأَمَّا الثَّلَاثُ الَّتِي أُقْسِمُ عَلَيْهِنَّ: فَإِنَّهُ مَا نَقَّصَ مَالَ عَبْدٍ صَدَقَةٌ، ولا ظُلِمَ عَبْدٌ بِمَظْلَمَةٍ فَيَصْبِرُ عَلَيْهَا إِلَّا زَادَهُ اللهُ بِهَا عِزًّا، وَلَا يَفْتَحُ عَبْدٌ بَابَ مَسْأَلَةٍ إِلَّا فَتَحَ اللهُ لَهُ بَابَ فَقْرٍ.<br/>
            وَأَمَّا الَّذِي أُحَدِّثُكُمْ حَدِيثًا فَاحْفَظُوهُ، فَإِنَّهُ قَالَ: إِنَّمَا الدُّنْيَا لِأَرْبَعَةِ نَفَرٍ : عَبْدٍ رَزَقَهُ اللهُ مَالًا وَعِلْمًا، فَهُوَ يَتَّقِي فِيهِ رَبَّهُ، وَيَصِلُ فِيهِ رَحِمَهُ، وَيَعْلَمُ لِلَّهِ فِيهِ حَقَّهُ. قَالَ: فَهَذَا بِأَفْضَلِ الْمَنَازِلِ. قَالَ: وَعَبْدٍ رَزَقَهُ اللهُ عِلْمًا، وَلَمْ يَرْزُقْهُ مَالًا، قَالَ: فَهُوَ يَقُولُ: لَوْ كَانَ لِي مَالٌ عَمِلْتُ بِعَمَلِ فُلَانٍ، قَالَ: فَأَجْرُهُمَا سَوَاءٌ. قَالَ: وَعَبْدٍ رَزَقَهُ اللهُ مَالًا وَلَمْ يَرْزُقْهُ عِلْمًا، فَهُوَ يَخْبِطُ فِي مَالِهِ بِغَيْرِ عِلْمٍ، لَا يَتَّقِي فِيهِ رَبَّهُ، وَلَا يَصِلُ فِيهِ رَحِمَهُ، وَلَا يَعْلَمُ لِلَّهِ فِيهِ حَقَّهُ، فَهَذَا بِأَخْبَثِ الْمَنَازِلِ. قَالَ: وَعَبْدِ لَمْ يَرْزُقْهُ اللهُ مَالًا وَلَا عِلْمًا، فَهُوَ يَقُولُ: لَوْ كَانَ لِي مَالٌ لَعَمِلْتُ  بِعَمَلِ فُلَانٍ، قَالَ: هِيَ نِيَّتُهُ، فَوِزْرُهُمَا فِيهِ سَوَاءٌ "`,
            searchText : `عن أبي كبشة الأنماري  قال: سمعت رسول الله صلى الله عليه وسلم يقول: " ثلاث أقسم عليهن، وأحدثكم حديثا فاحفظوه " قال: " فأما الثلاث التي أقسم عليهن: فإنه ما نقص مال عبد صدقة ، ولا ظلم عبد بمظلمة فيصبر عليها إلا زاده الله بها عزا، ولا يفتح عبد باب مسألة إلا فتح الله له باب فقر.
            وأما الذي أحدثكم حديثا فاحفظوه، فإنه قال: إنما الدنيا لأربعة نفر : عبد رزقه الله مالا وعلما، فهو يتقي فيه ربه، ويصل فيه رحمه، ويعلم لله فيه حقه. قال: فهذا بأفضل المنازل. قال: وعبد رزقه الله علما، ولم يرزقه مالا، قال: فهو يقول: لو كان لي مال عملت بعمل فلان، قال: فأجرهما سواء. قال: وعبد رزقه الله مالا ولم يرزقه علما، فهو يخبط في ماله بغير علم، لا يتقي فيه ربه، ولا يصل فيه رحمه، ولا يعلم لله فيه حقه، فهذا بأخبث المنازل. قال: وعبد لم يرزقه الله مالا ولا علما، فهو يقول: لو كان لي مال لعملت  بعمل فلان، قال: هي نيته، فوزرهما فيه سواء " `,
            info: `حديث حسن`,
        },
        {
            themaId: 2,
            numberInMasnad: 22692,
            numberInSite: 15,
            text: `عن عُبَادَةَ بْنِ الصَّامِتِ، أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم قَالَ: " مَنْ غَزَا فِي سَبِيلِ اللهِ وَهُوَ لَا يَنْوِي فِي غَزَاتِهِ إِلَّا عِقَالًا، فَلَهُ مَا نَوَى "`,
            searchText : `عبادة بن الصامت، أن رسول الله صلى الله عليه وسلم قال: " من غزا في سبيل الله وهو لا ينوي في غزاته إلا عقالا، فله ما نوى "`,
            info: `حسن لغيره`,
        },
        {
            themaId: 2,
            numberInMasnad: 9090,
            numberInSite: 16,
            text: `عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم، قَالَ: " يُبْعَثُ النَّاسُ - وَرُبَّمَا قَالَ شَرِيكٌ: يُحْشَرُ النَّاسُ - عَلَى نِيَّاتِهِمْ "`,
            searchText : `عن أبي هريرة، عن النبي صلى الله عليه وسلم، قال: " يبعث الناس - وربما قال شريك: يحشر الناس - على نياتهم "`,
            info: `صحيح لغيره، وإسناده ضعيف`,
        },
        {
            themaId: 2,
            numberInMasnad: 8593,
            numberInSite: 17,
            text: `عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم، قَالَ: " لَا يَجْتَمِعُ الْإِيمَانُ وَالْكُفْرُ فِي قَلْبِ امْرِئٍ، وَلَا يَجْتَمِعُ الصِّدْقُ وَالْكَذِبُ جَمِيعًا، وَلَا تَجْتَمِعُ الْخِيَانَةُ وَالْأَمَانَةُ جَمِيعًا "`,
            searchText : `عن أبي هريرة أن رسول الله صلى الله عليه وسلم، قال: " لا يجتمع الإيمان والكفر في قلب امرئ، ولا يجتمع الصدق والكذب جميعا، ولا تجتمع الخيانة والأمانة جميعا "`,
            info: `حديث حسن`,
        },
        {
            themaId: 2,
            numberInMasnad: 20739,
            numberInSite: 18,
            text: `عَنْ أَبِي قَتَادَةَ وَأَبِي الدَّهْمَاءِ، قَالَا: كَانَا يُكْثِرَانِ السَّفَرَ نَحْوَ هَذَا الْبَيْتِ، قَالَا: أَتَيْنَا عَلَى رَجُلٍ مِنْ أَهْلِ الْبَادِيَةِ، فَقَالَ الْبَدَوِيُّ: أَخَذَ بِيَدِي رَسُولُ اللهِ صلى الله عليه وسلم، فَجَعَلَ يُعَلِّمُنِي مِمَّا عَلَّمَهُ اللهُ، وَقَالَ: " إِنَّكَ لَنْ تَدَعَ شَيْئًا اتِّقَاءَ اللهِ إِلَّا أَعْطَاكَ اللهُ  خَيْرًا مِنْهُ "`,
            searchText : `عن أبي قتادة وأبي الدهماء، قالا: كانا يكثران السفر نحو هذا البيت، قالا: أتينا على رجل من أهل البادية، فقال البدوي: أخذ بيدي رسول الله صلى الله عليه وسلم، فجعل يعلمني مما علمه الله، وقال: " إنك لن تدع شيئا اتقاء الله إلا أعطاك الله  خيرا منه "`,
            info: `إسناده صحيح`,
        },
        {
            themaId: 2,
            numberInMasnad: 21220,
            numberInSite: 19,
            text: `عَنْ أُبَيِّ بْنِ كَعْبٍ، قَالَ: قَالَ رَسُولُ اللهِ صلى الله عليه وسلم: " بَشِّرْ هَذِهِ الْأُمَّةَ بِالسَّنَاءِ وَالرِّفْعَةِ، وَالدِّينِ، وَالنَّصْرِ، وَالتَّمْكِينِ فِي الْأَرْضِ " وَهُوَ يَشُكُّ فِي السَّادِسَةِ، قَالَ: " فَمَنْ عَمِلَ مِنْهُمْ عَمَلَ الْآخِرَةِ لِلدُّنْيَا، لَمْ يَكُنْ لَهُ فِي الْآخِرَةِ نَصِيبٌ`,
            searchText : `عن أبي بن كعب، قال: قال رسول الله صلى الله عليه وسلم: " بشر هذه الأمة بالسناء والرفعة، والدين، والنصر، والتمكين في الأرض " وهو يشك في السادسة، قال: " فمن عمل منهم عمل الآخرة للدنيا، لم يكن له في الآخرة نصيب`,
            info: `إسناده قوي`,
        },
        {
            // site 51 next site 52 new thema
            themaId: 2,
            numberInMasnad: 23324,
            numberInSite: 20,
            text: `عَنْ حُذَيْفَةَ قَالَ: أَسْنَدْتُ النَّبِيَّ صلى الله عليه وسلم إِلَى صَدْرِي، فَقَالَ: " مَنْ قَالَ لَا إِلَهَ إِلَّا اللهُ - قَالَ حَسَنٌ: ابْتِغَاءَ وَجْهِ اللهِ - خُتِمَ لَهُ بِهَا دَخَلَ الْجَنَّةَ، وَمَنْ صَامَ يَوْمًا ابْتِغَاءَ وَجْهِ اللهِ خُتِمَ لَهُ بِهَا، دَخَلَ الْجَنَّةَ، وَمَنْ تَصَدَّقَ بِصَدَقَةٍ ابْتِغَاءَ وَجْهِ اللهِ خُتِمَ لَهُ بِهَا، دَخَلَ الْجَنَّةَ "`,
            searchText : `عن حذيفة قال: أسندت النبي صلى الله عليه وسلم إلى صدري، فقال: " من قال لا إله إلا الله - قال حسن: ابتغاء وجه الله - ختم له بها دخل الجنة، ومن صام يوما ابتغاء وجه الله ختم له بها، دخل الجنة، ومن تصدق بصدقة ابتغاء وجه الله ختم له بها، دخل الجنة "`,
            info: `صحيح لغيره`,
        },
        {
            themaId: 3,
            numberInMasnad: 17813,
            numberInSite: 21,
            text: `أَنَّ عَمْرَو بْنَ الْعَاصِ، قَالَ: قُلْتُ: يَا رَسُولَ اللهِ، أُبَايِعُكَ عَلَى أَنْ تَغْفِرَ لِي مَا تَقَدَّمَ مِنْ ذَنْبِي؟ فَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم: " إِنَّ الْإِسْلَامَ يَجُبُّ مَا كَانَ قَبْلَهُ، وَإِنَّ الْهِجْرَةَ تَجُبُّ مَا كَانَ قَبْلَهَا ".<br/>
            قَالَ عَمْرٌو: فَوَاللهِ إِنْ كُنْتُ لَأَشَدَّ النَّاسِ حَيَاءً مِنْ رَسُولِ اللهِ صلى الله عليه وسلم، فَمَا مَلَأْتُ عَيْنِي مِنْ رَسُولِ اللهِ صلى الله عليه وسلم، وَلَا رَاجَعْتُهُ بِمَا أُرِيدُ، حَتَّى لَحِقَ بِاللهِ عز وجل حَيَاءً مِنْهُ`,
            searchText : `عن عمرو بن العاص، قال: قلت: يا رسول الله، أبايعك على أن تغفر لي ما تقدم من ذنبي؟ فقال رسول الله صلى الله عليه وسلم: " إن الإسلام يجب ما كان قبله، وإن الهجرة تجب ما كان قبلها ".
            قال عمرو: فوالله إن كنت لأشد الناس حياء من رسول الله صلى الله عليه وسلم، فما ملأت عيني من رسول الله صلى الله عليه وسلم، ولا راجعته بما أريد، حتى لحق بالله عز وجل حياء منه`,
            info: `الشطر الأول منه حسن، وهذا الإسناد ضعيف`,
        }
    ]
}