const book = {
    bookName: "الإسلام والإيمان"
    ,hasFasls: false,
    themas: [
        {id: 1, name: "أركان الإسلام والإيمان"},
        {id: 2, name: "الإخلاص والنية"},
        {id: 3, name: "الإسلام يهدم ما قبله"},
        {id: 4, name: "الإسلام نسخ الأديان السابقة"},
        {id: 5, name: "من مات على التوحيد دخل الجنة"},
        {id: 6, name: "من مات على الكفر دخل النار"},
        {id: 7, name: "حتى يقولوا \"لا إلاه إلا الله \""},
        {id: 8, name: "الزمن الذي لا يقبل فيه إيمان"},
        {id: 9, name: "الرحمن الرحيم"},
        {id: 10, name: "ادعوني أستجب لكم"},
        {id: 11, name: "إن الله لا ينام"},
        {id: 12, name: "صفة الصبر وغيرها"},
        {id: 13, name: "لا أحد أغير من الله تعالى"},
        {id: 14, name: "مؤمن بالله وكافر بالكواكب"},
        {id: 15, name: "حلاوة الإيمان"},
        {id: 16, name: "شعب الإيمان"},
        {id: 17, name: "حب النبي صلى الله عليه وسلم من الإيمان"},
        {id: 18, name: "الأمر بالعروف والنهي عن المنكر"},
        {id: 19, name: "من أمر بالمعروف ولم يأته"},
        {id: 20, name: "الإسلام والإيمان والإحسان"},
        {id: 21, name: "الوسوسة وحديث النفس"},
        {id: 22, name: "قول الشيطان : من خلق ربك ؟"},
        {id: 23, name: "كتابة الحسنات والسيئات"},
        {id: 24, name: "جزاء الحسنات للمؤمن والكافر"},
        {id: 25, name: "من عمل خيراً قبل إسلامه"},
        {id: 26, name: "الاقتصار على الفروض"},
        {id: 27, name: "الدين يسر"},
        {id: 28, name: "الدين النصيحة"},
        {id: 29, name: "المسلم والمهاجر"},
        {id: 30, name: "قل آمنت بالله ثم استقم"},
        {id: 31, name: "ما يحب لنفسه"},
        {id: 32, name: "المنافقون وصفاتهم"},
        {id: 33, name: "البيعة"},
        {id: 34, name: "الثبات على الدين"},
        {id: 35, name: "(احفظ الله يحفظك)"},
        {id: 36, name: "أجر الدعوة إلى الله"},
        {id: 37, name: "زيادة الإيمان ونقصانه"},
        {id: 38, name: "افتراق هذه الأمة"},
        {id: 38, name: "تجديد أمر الدين وتأييده"},
        {id: 38, name: "نقض عرا الدين"}
    ],
    ahadith_sharefa: [
        {
            themaId: 1,
            numberInMasnad: 6015,
            numberInSite: 1,
            text: `عَنْ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم، قَالَ: " بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لَا إِلَهَ إِلَّا اللهُ، وَأَنَّ مُحَمَّدًا رَسُولُ اللهِ، وَإِقَامِ الصَّلَاةِ، وَإِيتَاءِ الزَّكَاةِ، وَحَجِّ الْبَيْتِ، وَصَوْمِ رَمَضَانَ "`,
            searchText : `عن ابن عمر، عن النبي صلى الله عليه وسلم، قال: " بني الإسلام على خمس: شهادة أن لا إله إلا الله، وأن محمدا رسول الله، وإقام الصلاة، وإيتاء الزكاة، وحج البيت، وصوم رمضان "`,
            info: `حديث متفق عليه <br/>إسناده صحيح`,
        },
        {
            themaId: 1,
            numberInMasnad: 12457,
            numberInSite: 2,
            text: `عَنْ أَنَسِ بْنِ مَالِكٍ قَالَ: كُنَّا قَدْ نُهِينَا أَنْ نَسْأَلَ رَسُولَ اللهِ صلى الله عليه وسلم عَنْ شَيْءٍ (3)، فَكَانَ يُعْجِبُنَا أَنْ يَجِيءَ الرَّجُلُ مِنْ أَهْلِ الْبَادِيَةِ الْعَاقِلُ، فَيَسْأَلُهُ وَنَحْنُ نَسْمَعُ، فَجَاءَ رَجُلٌ مِنْ أَهْلِ الْبَادِيَةِ، فَقَالَ: يَا مُحَمَّدُ، أَتَانَا رَسُولُكَ فَزَعَمَ لَنَا أَنَّكَ تَزْعُمُ أَنَّ اللهَ أَرْسَلَكَ. قَالَ: " صَدَقَ " قَالَ: فَمَنْ خَلَقَ السَّمَاءَ؟ قَالَ: " اللهُ " قَالَ: فَمَنْ خَلَقَ الْأَرْضَ؟ قَالَ: " اللهُ " قَالَ: فَمَنْ نَصَبَ هَذِهِ الْجِبَالَ، وَجَعَلَ فِيهَا مَا جَعَلَ؟ قَالَ: " اللهُ " قَالَ: فَبِالَّذِي خَلَقَ السَّمَاءَ، وَخَلَقَ الْأَرْضَ، وَنَصَبَ هَذِهِ الْجِبَالَ، آللَّهُ أَرْسَلَكَ؟ قَالَ: " نَعَمْ "<br /> قَالَ: فَزَعَمَ رَسُولُكَ أَنَّ عَلَيْنَا خَمْسَ صَلَوَاتٍ فِي يَوْمِنَا وَلَيْلَتِنَا. قَالَ: " صَدَقَ " قَالَ: فَبِالَّذِي أَرْسَلَكَ، آللَّهُ أَمَرَكَ بِهَذَا؟ قَالَ: " نَعَمْ "<br/>قَالَ: وَزَعَمَ رَسُولُكَ أَنَّ عَلَيْنَا زَكَاةً فِي أَمْوَالِنَا. قَالَ: " صَدَقَ " قَالَ: فَبِالَّذِي أَرْسَلَكَ. آللَّهُ أَمَرَكَ بِهَذَا؟ قَالَ: " نَعَمْ "</br>قَالَ: وَزَعَمَ رَسُولُكَ أَنَّ عَلَيْنَا صَوْمَ شَهْرِ (1) فِي سَنَتِنَا. قَالَ: " صَدَقَ " (2). قَالَ: فَبِالَّذِي أَرْسَلَكَ، آللَّهُ أَمَرَكَ بِهَذَا؟ قَالَ: " نَعَمْ "<br/>قَالَ: وَزَعَمَ رَسُولُكَ أَنَّ عَلَيْنَا حَجَّ الْبَيْتِ مَنْ اسْتَطَاعَ إِلَيْهِ سَبِيلًا. قَالَ: " صَدَقَ "<br/>قَالَ: ثُمَّ وَلَّى، فَقَالَ: وَالَّذِي بَعَثَكَ بِالْحَقِّ (3)، لَا أَزِيدُ عَلَيْهِنَّ شَيْئًا، وَلَا أَنْقُصُ مِنْهُنَّ شَيْئًا. فَقَالَ النَّبِيُّ صلى الله عليه وسلم: " لَئِنْ صَدَقَ، لَيَدْخُلَنَّ الْجَنَّةَ "`,
            searchText : `عن أنس بن مالك قال: كنا قد نهينا أن نسأل رسول الله صلى الله عليه وسلم عن شيء ، فكان يعجبنا أن يجيء الرجل من أهل البادية العاقل، فيسأله ونحن نسمع، فجاء رجل من أهل البادية، فقال: يا محمد، أتانا رسولك فزعم لنا أنك تزعم أن الله أرسلك. قال: " صدق " قال: فمن خلق السماء؟ قال: " الله " قال: فمن خلق الأرض؟ قال: " الله " قال: فمن نصب هذه الجبال، وجعل فيها ما جعل؟ قال: " الله " قال: فبالذي خلق السماء، وخلق الأرض، ونصب هذه الجبال، آلله أرسلك؟ قال: " نعم " قال: وزعم رسولك أن علينا زكاة في أموالنا. قال: " صدق " قال: فبالذي أرسلك. آلله أمرك بهذا؟ قال: " نعم ".
            قال: وزعم رسولك أن علينا صوم شهر  في سنتنا. قال: " صدق ". قال: فبالذي أرسلك، آلله أمرك بهذا؟ قال: " نعم ".
            قال: وزعم رسولك أن علينا حج البيت من استطاع إليه سبيلا. قال: " صدق ".
            قال: ثم ولى، فقال: والذي بعثك بالحق ، لا أزيد عليهن شيئا، ولا أنقص منهن شيئا. فقال النبي صلى الله عليه وسلم: " لئن صدق، ليدخلن الجنة "`,
            info: `رواه مسلم <br> إسناده صحيح على شرط مسلم`,
        },
        {
            themaId: 1,
            numberInMasnad: "22016/22133",
            numberInSite: 3,
            text: `عَنْ مُعَاذِ بْنِ جَبَلٍ، قَالَ: كُنْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي سَفَرٍ، فَأَصْبَحْتُ يَوْمًا قَرِيبًا مِنْهُ وَنَحْنُ نَسِيرُ، فَقُلْتُ: يَا نَبِيَّ اللهِ، أَخْبِرْنِي بِعَمَلٍ يُدْخِلُنِي الْجَنَّةَ، وَيُبَاعِدُنِي مِنَ النَّارِ. قَالَ: " لَقَدْ سَأَلْتَ عَنْ عَظِيمٍ، وَإِنَّهُ لَيَسِيرٌ عَلَى مَنْ يَسَّرَهُ اللهُ عَلَيْهِ، تَعْبُدُ اللهَ وَلَا تُشْرِكُ بِهِ شَيْئًا، وَتُقِيمُ الصَّلَاةَ، وَتُؤْتِي الزَّكَاةَ، وَتَصُومُ رَمَضَانَ، وَتَحُجُّ الْبَيْتَ " ثُمَّ قَالَ: " أَلَا أَدُلُّكَ عَلَى أَبْوَابِ الْخَيْرِ؟: الصَّوْمُ جُنَّةٌ، وَالصَّدَقَةُ تُطْفِئُ الْخَطِيئَةَ، وَصَلَاةُ الرَّجُلِ فِي جَوْفِ اللَّيْلِ " ثُمَّ قَرَأَ: {تَتَجَافَى جُنُوبُهُمْ عَنِ الْمَضَاجِعِ} حَتَّى بَلَغَ {يَعْمَلُونَ} [السجدة: 16 - 17] ثُمَّ قَالَ: " أَلَا أُخْبِرُكَ بِرَأْسِ الْأَمْرِ وَعَمُودِهِ وَذُرْوَةِ سَنَامِهِ؟ " فَقُلْتُ: بَلَى يَا رَسُولَ اللهِ. قَالَ: " رَأْسُ الْأَمْرِ الْإِسْلَامُ ، وَعَمُودُهُ الصَّلَاةُ، وَذِرْوَةُ سَنَامِهِ الْجِهَادُ " ثُمَّ قَالَ: " أَلَا أُخْبِرُكَ بِمِلَاكِ ذَلِكَ كُلِّهِ؟ " فَقُلْتُ لَهُ: بَلَى يَا نَبِيَّ اللهِ. فَأَخَذَ بِلِسَانِهِ، فَقَالَ: " كُفَّ عَلَيْكَ هَذَا " فَقُلْتُ: يَا رَسُولَ اللهِ، وَإِنَّا لَمُؤَاخَذُونَ بِمَا نَتَكَلَّمُ بِهِ؟ فَقَالَ: " ثَكِلَتْكَ أُمُّكَ يَا مُعَاذُ، وَهَلْ يَكُبُّ النَّاسَ فِي النَّارِ عَلَى وُجُوهِهِمْ  - أَوْ قَالَ: عَلَى مَنَاخِرِهِمْ - إِلَّا حَصَائِدُ أَلْسِنَتِهِمْ؟!  <br/>وفي رواية قال: " سَأُنَبِّئُكَ بِأَبْوَابٍ مِنَ الْخَيْرِ: الصَّوْمُ جُنَّةٌ، وَالصَّدَقَةُ تُطْفِئُ الْخَطِيئَةَ كَمَا يُطْفِئُ الْمَاءُ النَّارَ، وَقِيَامُ الْعَبْدِ مِنَ اللَّيْلِ " ثُمَّ قَرَأَ {تَتَجَافَى جُنُوبُهُمْ عَنِ الْمَضَاجِعِ} إِلَى آخِرِ الْآيَةِ [السجدة: 16]"`,
            searchText : `عن معاذ بن جبل، قال: كنت مع النبي صلى الله عليه وسلم في سفر، فأصبحت يوما قريبا منه ونحن نسير، فقلت: يا نبي الله، أخبرني بعمل يدخلني الجنة، ويباعدني من النار. قال: " لقد سألت عن عظيم، وإنه ليسير على من يسره الله عليه، تعبد الله ولا تشرك به شيئا، وتقيم الصلاة، وتؤتي الزكاة، وتصوم رمضان، وتحج البيت " ثم قال: " ألا أدلك على أبواب الخير؟: الصوم جنة، والصدقة تطفئ الخطيئة، وصلاة الرجل في جوف الليل " ثم قرأ: {تتجافى جنوبهم عن المضاجع} حتى بلغ {يعملون} [السجدة: 16 - 17] ثم قال: " ألا أخبرك برأس الأمر وعموده وذروة سنامه؟ " فقلت: بلى يا رسول الله. قال: " رأس الأمر الإسلام ، وعموده الصلاة، وذروة سنامه الجهاد " ثم قال: " ألا أخبرك بملاك ذلك كله؟ " فقلت له: بلى يا نبي الله. فأخذ بلسانه، فقال: " كف عليك هذا " فقلت: يا رسول الله، وإنا لمؤاخذون بما نتكلم به؟ فقال: " ثكلتك أمك يا معاذ، وهل يكب الناس في النار على وجوههم  - أو قال: على مناخرهم - إلا حصائد ألسنتهم؟! "`,
            info: `صحيح بطرقه وشواهده`,
        },
        {
            themaId: 1,
            numberInMasnad: 22122,
            numberInSite: 4,
            text: `عَنْ حَدِيثِ مُعَاذِ بْنِ جَبَلٍ: أَنَّ رَسُولَ اللهِ صلى الله عليه وسلم خَرَجَ بِالنَّاسِ قِبَلَ غَزْوَةِ تَبُوكَ، فَلَمَّا أَنْ أَصْبَحَ صَلَّى بِالنَّاسِ صَلَاةَ الصُّبْحِ، ثُمَّ إِنَّ النَّاسَ رَكِبُوا، فَلَمَّا أَنْ طَلَعَتِ الشَّمْسُ نَعَسَ النَّاسُ عَلَى أَثَرِ الدُّلْجَةِ وَلَزِمَ مُعَاذٌ رَسُولَ اللهِ صلى الله عليه وسلم يَتْلُو أَثَرَهُ، وَالنَّاسُ تَفَرَّقَتْ بِهِمْ رِكَابُهُمْ عَلَى جَوَادِّ الطَّرِيقِ ، تَأْكُلُ وَتَسِيرُ، فَبَيْنَمَا مُعَاذٌ عَلَى أَثَرِ رَسُولِ اللهِ صلى الله عليه وسلم وَنَاقَتُهُ تَأْكُلُ مَرَّةً وَتَسِيرُ أُخْرَى، عَثَرَتْ نَاقَةُ مُعَاذٍ فَكَبَحَهَا بِالزِّمَامِ، فَهَبَّتْ حَتَّى نَفَرَتْ مِنْهَا نَاقَةُ رَسُولِ اللهِ صلى الله عليه وسلم، ثُمَّ إِنَّ رَسُولَ اللهِ صلى الله عليه وسلم كَشْفَ عَنْهُ قِنَاعَهُ، فَالْتَفَتَ فَإِذَا لَيْسَ مِنَ الْجَيْشِ رَجُلٌ أَدْنَى إِلَيْهِ مِنْ مُعَاذٍ، فَنَادَاهُ رَسُولُ اللهِ صلى الله عليه وسلم فَقَالَ: " يَا مُعَاذُ " قَالَ: لَبَّيْكَ يَا نَبِيَّ اللهِ. قَالَ: " ادْنُ دُونَكَ " فَدَنَا مِنْهُ حَتَّى لَصِقَتْ رَاحِلَتَاهُمَا إِحْدَاهُمَا بِالْأُخْرَى، فَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم: " مَا كُنْتُ أَحْسِبُ النَّاسَ مِنَّا كَمَكَانِهِمْ مِنَ الْبُعْدِ " فَقَالَ مُعَاذٌ: يَا نَبِيَّ اللهِ، نَعَسَ النَّاسُ، فَتَفَرَّقَتْ بِهِمْ رِكَابُهُمْ تَرْتَعُ وَتَسِيرُ. فَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم: " وَأَنَا كُنْتُ نَاعِسًا "<br/>فَلَمَّا رَأَى مُعَاذٌ بُشْرَى رَسُولِ اللهِ صلى الله عليه وسلم إِلَيْهِ وَخَلْوَتَهُ لَهُ، قَالَ: يَا رَسُولَ اللهِ، ائْذَنْ لِي أَسْأَلْكَ عَنْ كَلِمَةٍ قَدْ أَمْرَضَتْنِي وَأَسْقَمَتْنِي وَأَحْزَنَتْنِي. فَقَالَ نَبِيُّ اللهِ صلى الله عليه وسلم: " سَلْنِي عَمَّ شِئْتَ " قَالَ: يَا نَبِيَّ اللهِ، حَدِّثْنِي بِعَمَلٍ يُدْخِلُنِي الْجَنَّةَ لَا أَسْأَلُكَ عَنْ شَيْءٍ غَيْرِه. قَالَ نَبِيُّ اللهِ صلى الله عليه وسلم: " بَخٍ بَخٍ بَخٍ، لَقَدْ سَأَلْتَ بِعَظِيمٍ، لَقَدْ سَأَلْتَ بِعَظِيمٍ - ثَلَاثًا - وَإِنَّهُ لَيَسِيرٌ عَلَى مَنْ أَرَادَ اللهُ بِهِ الْخَيْرَ، وَإِنَّهُ لَيَسِيرٌ عَلَى مَنْ أَرَادَ اللهُ بِهِ الْخَيْرَ، وَإِنَّهُ لَيَسِيرٌ عَلَى مَنْ أَرَادَ اللهُ بِهِ الْخَيْرَ " فَلَمْ يُحَدِّثْهُ بِشَيْءٍ إِلَّا قَالَهُ لَهُ ثَلَاثَ مَرَّاتٍ، يَعْنِي: أَعَادَهُ عَلَيْهِ ثَلَاثَ مَرَّاتٍ حِرْصًا لِكَيْمَا يُتْقِنَهُ عَنْهُ، فَقَالَ نَبِيُّ اللهِ صلى الله عليه وسلم: " تُؤْمِنُ بِاللهِ وَالْيَوْمِ الْآخِرِ، وَتُقِيمُ الصَّلَاةَ، وَتَعْبُدُ اللهَ وَحْدَهُ لَا تُشْرِكُ بِهِ شَيْئًا حَتَّى تَمُوتَ وَأَنْتَ عَلَى ذَلِكَ " فَقَالَ: يَا نَبِيَّ اللهِ، أَعِدْ لِي، فَأَعَادَهَا لَهُ ثَلَاثَ مَرَّاتٍ<br/> ثُمَّ قَالَ نَبِيُّ اللهِ صلى الله عليه وسلم: " إِنْ شِئْتَ حَدَّثْتُكَ يَا مُعَاذُ بِرَأْسِ هَذَا الْأَمْرِ وَقَوَامِ هَذَا الْأَمْرِ، وَذُرْوَةِ السَّنَامِ " فَقَالَ مُعَاذٌ: بَلَى، بِأَبِي وَأُمِّي أَنْتَ يَا نَبِيَّ اللهِ، فَحَدِّثْنِي. فَقَالَ نَبِيُّ اللهِ صلى الله عليه وسلم: " إِنَّ رَأْسَ هَذَا الْأَمْرِ أَنْ تَشْهَدَ أَنْ لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ، وَإِنَّ قَوَامَ هَذَا الْأَمْرِ إِقَامُ الصَّلَاةِ وَإِيتَاءُ الزَّكَاةِ، وَإِنَّ ذُرْوَةَ السَّنَامِ مِنْهُ الْجِهَادُ فِي سَبِيلِ اللهِ، إِنَّمَا أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يُقِيمُوا الصَّلَاةَ وَيُؤْتُوا الزَّكَاةَ، وَيَشْهَدُوا أَنْ لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ، فَإِذَا فَعَلُوا ذَلِكَ فَقَدِ اعْتَصَمُوا وَعَصَمُوا دِمَاءَهُمْ وَأَمْوَالَهُمْ، إِلَّا بِحَقِّهَا، وَحِسَابُهُمْ عَلَى اللهِ "<br/>وَقَالَ رَسُولُ اللهِ صلى الله عليه وسلم: " وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ، مَا شَحَبَ وَجْهٌ، وَلَا اغْبَرَّتْ قَدَمٌ فِي عَمَلٍ تُبْتَغَى فِيهِ دَرَجَاتُ الْجَنَّةِ بَعْدَ الصَّلَاةِ الْمَفْرُوضَةِ، كَجِهَادٍ فِي سَبِيلِ اللهِ، وَلَا ثَقُلَ مِيزَانُ عَبْدٍ، كَدَابَّةٍ تَنْفُقُ لَهُ فِي سَبِيلِ اللهِ، أَوْ يَحْمِلُ عَلَيْهَا فِي سَبِيلِ اللهِ "`,
            searchText : `عن حديث معاذ بن جبل: أن رسول الله صلى الله عليه وسلم خرج بالناس قبل غزوة تبوك، فلما أن أصبح صلى بالناس صلاة الصبح، ثم إن الناس ركبوا، فلما أن طلعت الشمس نعس الناس على أثر الدلجة ولزم معاذ رسول الله صلى الله عليه وسلم يتلو أثره، والناس تفرقت بهم ركابهم على جواد الطريق (1)، تأكل وتسير، فبينما معاذ على أثر رسول الله صلى الله عليه وسلم وناقته تأكل مرة وتسير أخرى، عثرت ناقة معاذ فكبحها بالزمام، فهبت حتى نفرت منها ناقة رسول الله صلى الله عليه وسلم، ثم إن رسول الله صلى الله عليه وسلم كشف عنه قناعه، فالتفت فإذا ليس من الجيش رجل أدنى إليه من معاذ، فناداه رسول الله صلى الله عليه وسلم فقال: " يا معاذ " قال: لبيك يا نبي الله. قال: " ادن دونك " فدنا منه حتى لصقت راحلتاهما إحداهما بالأخرى، فقال رسول الله صلى الله عليه وسلم: " ما كنت أحسب الناس منا كمكانهم من البعد " فقال معاذ: يا نبي الله، نعس الناس، فتفرقت بهم ركابهم ترتع وتسير. فقال رسول الله صلى الله عليه وسلم: " وأنا كنت ناعسا ".
            فلما رأى معاذ بشرى رسول الله صلى الله عليه وسلم إليه وخلوته له، قال: يا رسول الله، ائذن لي أسألك عن كلمة قد أمرضتني وأسقمتني وأحزنتني. فقال نبي الله صلى الله عليه وسلم: " سلني عم شئت " قال: يا نبي الله، حدثني بعمل يدخلني الجنة لا أسألك عن شيء غيره. قال نبي الله صلى الله عليه وسلم: " بخ بخ بخ، لقد سألت بعظيم، لقد سألت بعظيم - ثلاثا - وإنه ليسير على من أراد الله به الخير، وإنه ليسير على من أراد الله به الخير، وإنه ليسير على من أراد الله به الخير " فلم يحدثه بشيء إلا قاله له ثلاث مرات، يعني: أعاده عليه ثلاث مرات حرصا لكيما يتقنه عنه، فقال نبي الله صلى الله عليه وسلم: " تؤمن بالله واليوم الآخر، وتقيم الصلاة، وتعبد الله وحده لا تشرك به شيئا حتى تموت وأنت على ذلك " فقال: يا نبي الله، أعد لي، فأعادها له ثلاث مرات.
            ثم قال نبي الله صلى الله عليه وسلم: " إن شئت حدثتك يا معاذ برأس هذا الأمر وقوام هذا الأمر، وذروة السنام " فقال معاذ: بلى، بأبي وأمي أنت يا نبي الله، فحدثني. فقال نبي الله صلى الله عليه وسلم: " إن رأس هذا الأمر أن تشهد أن لا إله إلا الله وحده لا شريك له، وأن محمدا عبده ورسوله، وإن قوام هذا الأمر إقام الصلاة وإيتاء الزكاة، وإن ذروة السنام منه الجهاد في سبيل الله، إنما أمرت أن أقاتل الناس حتى يقيموا الصلاة ويؤتوا الزكاة، ويشهدوا أن لا إله إلا الله وحده لا شريك له وأن محمدا عبده ورسوله، فإذا فعلوا ذلك فقد اعتصموا وعصموا دماءهم وأموالهم، إلا بحقها، وحسابهم على الله ".
            وقال رسول الله صلى الله عليه وسلم: " والذي نفس محمد بيده، ما شحب وجه، ولا اغبرت قدم في عمل تبتغى فيه درجات الجنة بعد الصلاة المفروضة، كجهاد في سبيل الله، ولا ثقل ميزان عبد، كدابة تنفق له في سبيل الله، أو يحمل عليها في سبيل الله "`,
            info: ` الحديث من سؤال معاذ إلى آخره صحيح بطرقه وشواهده دون قوله: "ما شحب وجه … إلخ" فإنه حسن لغيره، وهذا إسناد ضعيف لضعف شهر بن حوشب`,
        },
        {
            themaId: 1,
            numberInMasnad: 19220,
            numberInSite: 5,
            text: `عَنْ جَرِيرٍ، قَالَ: قَالَ رَسُولُ اللهِ صلى الله عليه وسلم: " بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لَا إِلَهَ إِلَّا اللهُ، وَإِقَامِ الصَّلَاةِ، وَإِيتَاءِ الزَّكَاةِ، وَحَجُِّ الْبَيْتِ، وَصَوْمِ رَمَضَانَ "`,
            searchText : `عن جرير، قال: قال رسول الله صلى الله عليه وسلم: " بني الإسلام على خمس: شهادة أن لا إله إلا الله، وإقام الصلاة، وإيتاء الزكاة، وحج البيت، وصوم رمضان "`,
            info: `صحيح لغيره`,
        },
        {
            themaId: 1,
            numberInMasnad: 22768,
            numberInSite: 6,
            text: `عَنْ عُبَادَةَ بْنِ الصَّامِتِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ: " مَنْ عَبَدَ اللهَ لَا يُشْرِكُ بِهِ شَيْئًا فَأَقَامَ الصَّلَاةَ، وَآتَى الزَّكَاةَ، وَسَمِعَ وَأَطَاعَ، فَإِنَّ اللهَ يُدْخِلُهُ مِنْ أَيِّ أَبْوَابِ الْجَنَّةِ شَاءَ، وَلَهَا ثَمَانِيَةُ أَبْوَابٍ، وَمَنْ عَبَدَ اللهَ لَا يُشْرِكُ بِهِ شَيْئًا، وَأَقَامَ الصَّلَاةَ، وَآتَى الزَّكَاةَ، وَسَمِعَ وَعَصَى، فَإِنَّ اللهَ مِنْ أَمْرِهِ بِالْخِيَارِ، إِنْ شَاءَ رَحِمَهُ، وَإِنْ شَاءَ عَذَّبَهُ "`,
            searchText : `عن عبادة بن الصامت، أن النبي صلى الله عليه وسلم قال: " من عبد الله لا يشرك به شيئا فأقام الصلاة، وآتى الزكاة، وسمع وأطاع، فإن الله يدخله من أي أبواب الجنة شاء، ولها ثمانية أبواب، ومن عبد الله لا يشرك به شيئا، وأقام الصلاة، وآتى الزكاة، وسمع وعصى، فإن الله من أمره بالخيار، إن شاء رحمه، وإن شاء عذبه "`,
            info: `إسناده حسن`,
        },
        {
            themaId: 1,
            numberInMasnad: 20011,
            numberInSite: 7,
            text: `عَنْ حَكِيمِ بْنِ مُعَاوِيَةَ الْبَهْزِيِّ، عَنْ أَبِيهِ، أَنَّهُ قَالَ لِلنَّبِيِّ صلى الله عليه وسلم: إِنِّي حَلَفْتُ هَكَذَا - وَنَشَرَ أَصَابِعَ يَدَيْهِ - حَتَّى تُخْبِرَنِي مَا الَّذِي بَعَثَكَ اللهُ بِهِ. قَالَ: " بَعَثَنِي اللهُ بِالْإِسْلَامِ " قَالَ: وَمَا الْإِسْلَامُ؟ قَالَ: " شَهَادَةُ أَنْ لَا إِلَهَ إِلَّا اللهُ، وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ، وَتُقِيمُ الصَّلَاةَ، وَتُؤْتِي الزَّكَاةَ، أَخَوَانِ نَصِيرَانِ، لَا يَقْبَلُ اللهُ مِنْ أَحَدٍ تَوْبَةً أَشْرَكَ بَعْدَ إِسْلَامِهِ " <br/>قَالَ: قُلْتُ: يَا رَسُولَ اللهِ، مَا حَقُّ زَوْجِ أَحَدِنَا عَلَيْهِ؟ قَالَ: " تُطْعِمُهَا إِذَا أَكَلْتَ، وَتَكْسُوهَا إِذَا اكْتَسَيْتَ، وَلَا تَضْرِبِ الْوَجْهَ، وَلَا تُقَبِّحْ، وَلَا تَهْجُرْ إِلَّا فِي الْبَيْتِ "<br/>ثُمَّ قَالَ: " هَاهُنَا تُحْشَرُونَ، هَاهُنَا تُحْشَرُونَ، هَاهُنَا تُحْشَرُونَ - ثَلَاثًا - رُكْبَانًا وَمُشَاةً وَعَلَى وُجُوهِكُمْ ، تُوفُونَ يَوْمَ الْقِيَامَةِ سَبْعِينَ أُمَّةً، أَنْتُمْ آخِرُ الْأُمَمِ وَأَكْرَمُهَا عَلَى اللهِ، تَأْتُونَ يَوْمَ الْقِيَامَةِ وَعَلَى أَفْوَاهِكُمُ الْفِدَامُ، أَوَّلُ مَا يُعْرِبُ عَنْ أَحَدِكُمْ فَخِذُهُ ". قَالَ ابْنُ أَبِي بُكَيْرٍ: فَأَشَارَ بِيَدِهِ إِلَى الشَّامِ، فَقَالَ: " إِلَى هَاهُنَا تُحْشَرُونَ "`,
            searchText : `عن حكيم بن معاوية البهزي، عن أبيه، أنه قال للنبي صلى الله عليه وسلم: إني حلفت هكذا - ونشر أصابع يديه - حتى تخبرني ما الذي بعثك الله به. قال: " بعثني الله بالإسلام " قال: وما الإسلام؟ قال: " شهادة أن لا إله إلا الله، وأن محمدا عبده ورسوله، وتقيم الصلاة، وتؤتي الزكاة، أخوان نصيران، لا يقبل الله من أحد توبة أشرك بعد إسلامه ".
            قال: قلت: يا رسول الله، ما حق زوج أحدنا عليه؟ قال: " تطعمها إذا أكلت، وتكسوها إذا اكتسيت، ولا تضرب الوجه، ولا تقبح، ولا تهجر إلا في البيت " ثم قال: " هاهنا تحشرون، هاهنا تحشرون، هاهنا تحشرون - ثلاثا - ركبانا ومشاة وعلى وجوهكم ، توفون يوم القيامة سبعين  أمة، أنتم آخر الأمم وأكرمها على الله، تأتون يوم القيامة وعلى أفواهكم الفدام، أول ما يعرب عن أحدكم فخذه ". قال ابن أبي بكير: فأشار بيده إلى الشام، فقال: " إلى هاهنا تحشرون "`,
            info: `إسناده حسن`,
        }
    ]
}